HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxSmu_bf.h
/** \brief Length for Ifx_SMU_AEXCLR_Bits.EMSCLR */
#define IFX_SMU_AEXCLR_EMSCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.EMSCLR */
#define IFX_SMU_AEXCLR_EMSCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.EMSCLR */
#define IFX_SMU_AEXCLR_EMSCLR_OFF (11u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.IRQ0AEMCLR */
#define IFX_SMU_AEXCLR_IRQ0AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.IRQ0AEMCLR */
#define IFX_SMU_AEXCLR_IRQ0AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.IRQ0AEMCLR */
#define IFX_SMU_AEXCLR_IRQ0AEMCLR_OFF (16u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.IRQ1AEMCLR */
#define IFX_SMU_AEXCLR_IRQ1AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.IRQ1AEMCLR */
#define IFX_SMU_AEXCLR_IRQ1AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.IRQ1AEMCLR */
#define IFX_SMU_AEXCLR_IRQ1AEMCLR_OFF (17u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.IRQ2AEMCLR */
#define IFX_SMU_AEXCLR_IRQ2AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.IRQ2AEMCLR */
#define IFX_SMU_AEXCLR_IRQ2AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.IRQ2AEMCLR */
#define IFX_SMU_AEXCLR_IRQ2AEMCLR_OFF (18u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.RST0AEMCLR */
#define IFX_SMU_AEXCLR_RST0AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.RST0AEMCLR */
#define IFX_SMU_AEXCLR_RST0AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.RST0AEMCLR */
#define IFX_SMU_AEXCLR_RST0AEMCLR_OFF (19u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.RST1AEMCLR */
#define IFX_SMU_AEXCLR_RST1AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.RST1AEMCLR */
#define IFX_SMU_AEXCLR_RST1AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.RST1AEMCLR */
#define IFX_SMU_AEXCLR_RST1AEMCLR_OFF (20u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.RST2AEMCLR */
#define IFX_SMU_AEXCLR_RST2AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.RST2AEMCLR */
#define IFX_SMU_AEXCLR_RST2AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.RST2AEMCLR */
#define IFX_SMU_AEXCLR_RST2AEMCLR_OFF (21u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.RST3AEMCLR */
#define IFX_SMU_AEXCLR_RST3AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.RST3AEMCLR */
#define IFX_SMU_AEXCLR_RST3AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.RST3AEMCLR */
#define IFX_SMU_AEXCLR_RST3AEMCLR_OFF (22u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.RST4AEMCLR */
#define IFX_SMU_AEXCLR_RST4AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.RST4AEMCLR */
#define IFX_SMU_AEXCLR_RST4AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.RST4AEMCLR */
#define IFX_SMU_AEXCLR_RST4AEMCLR_OFF (23u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.RST5AEMCLR */
#define IFX_SMU_AEXCLR_RST5AEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.RST5AEMCLR */
#define IFX_SMU_AEXCLR_RST5AEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.RST5AEMCLR */
#define IFX_SMU_AEXCLR_RST5AEMCLR_OFF (24u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.NMIAEMCLR */
#define IFX_SMU_AEXCLR_NMIAEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.NMIAEMCLR */
#define IFX_SMU_AEXCLR_NMIAEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.NMIAEMCLR */
#define IFX_SMU_AEXCLR_NMIAEMCLR_OFF (25u)

/** \brief Length for Ifx_SMU_AEXCLR_Bits.EMSAEMCLR */
#define IFX_SMU_AEXCLR_EMSAEMCLR_LEN (1u)

/** \brief Mask for Ifx_SMU_AEXCLR_Bits.EMSAEMCLR */
#define IFX_SMU_AEXCLR_EMSAEMCLR_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AEXCLR_Bits.EMSAEMCLR */
#define IFX_SMU_AEXCLR_EMSAEMCLR_OFF (27u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF0 */
#define IFX_SMU_AGCF_CF0_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF0 */
#define IFX_SMU_AGCF_CF0_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF0 */
#define IFX_SMU_AGCF_CF0_OFF (0u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF1 */
#define IFX_SMU_AGCF_CF1_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF1 */
#define IFX_SMU_AGCF_CF1_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF1 */
#define IFX_SMU_AGCF_CF1_OFF (1u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF2 */
#define IFX_SMU_AGCF_CF2_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF2 */
#define IFX_SMU_AGCF_CF2_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF2 */
#define IFX_SMU_AGCF_CF2_OFF (2u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF3 */
#define IFX_SMU_AGCF_CF3_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF3 */
#define IFX_SMU_AGCF_CF3_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF3 */
#define IFX_SMU_AGCF_CF3_OFF (3u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF4 */
#define IFX_SMU_AGCF_CF4_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF4 */
#define IFX_SMU_AGCF_CF4_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF4 */
#define IFX_SMU_AGCF_CF4_OFF (4u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF5 */
#define IFX_SMU_AGCF_CF5_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF5 */
#define IFX_SMU_AGCF_CF5_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF5 */
#define IFX_SMU_AGCF_CF5_OFF (5u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF6 */
#define IFX_SMU_AGCF_CF6_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF6 */
#define IFX_SMU_AGCF_CF6_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF6 */
#define IFX_SMU_AGCF_CF6_OFF (6u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF7 */
#define IFX_SMU_AGCF_CF7_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF7 */
#define IFX_SMU_AGCF_CF7_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF7 */
#define IFX_SMU_AGCF_CF7_OFF (7u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF8 */
#define IFX_SMU_AGCF_CF8_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF8 */
#define IFX_SMU_AGCF_CF8_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF8 */
#define IFX_SMU_AGCF_CF8_OFF (8u)

/** \brief Length for Ifx_SMU_AGCF_Bits.CF9 */
#define IFX_SMU_AGCF_CF9_LEN (1u)

/** \brief Mask for Ifx_SMU_AGCF_Bits.CF9 */
#define IFX_SMU_AGCF_CF9_MSK (0x1u)

/** \brief Offset for Ifx_SMU_AGCF_Bits.CF9 */
#define IFX_SMU_AGCF_CF9_OFF (9u)

